DataProcessors/ЗагрузкаКонтактовXLS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКонтактовXLS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тзДанныеИзФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Телефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Телефоны</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Должники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТелефонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодтверждениеДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаКонтактовXLS/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ПутьКФайлу; //АДРЕС
	ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	Если ЗначениеЗаполнено(ПутьКФайлу) = Ложь Тогда
		ПоказатьПредупреждение(, "Не выбран файл для загрузки. Отмена.")
	Иначе
		ПрочитатьФайл();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработан файл " + ПутьКФайлу);
		Элементы.тзДанныеИзФайлаСоздать.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтакты(Команда)
	СоздатьКонтактыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтактыНаСервере()
	ТЗ_Данные = Новый ТаблицаЗначений;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Телефоны"));
	ТЗ_Данные.Колонки.Добавить("Телефон", Новый ОписаниеТипов(МассивТипов));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ТЗ_Данные.Колонки.Добавить("Результат", Новый ОписаниеТипов(МассивТипов,,Новый КвалификаторыСтроки(100)));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Должники"));
	ТЗ_Данные.Колонки.Добавить("Должник", Новый ОписаниеТипов(МассивТипов));
	
	Для Каждого Стр Из Объект.тзДанныеИзФайла Цикл
		СтрНов = ТЗ_Данные.Добавить();
		
		Телефон = Справочники.Телефоны.НайтиПоРеквизиту("Номер", Стр.Телефон);
		СтрНов.Телефон = Телефон;
		СтрНов.Результат = Стр.Результат;
		СтрНов.Должник = Телефон.Владелец;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_Данные", ТЗ_Данные);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ_Данные.Телефон КАК Телефон,
	               |	ТЗ_Данные.Результат КАК Результат,
	               |	ТЗ_Данные.Должник КАК Должник
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ
	               |	&ТЗ_Данные КАК ТЗ_Данные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.Телефон КАК Телефон,
	               |	ВТ_Данные.Результат КАК Результат,
	               |	ВТ_Данные.Должник КАК Должник
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |ИТОГИ ПО
	               |	Должник,
	               |	Результат";
	
	ВыборкаПоДолжникам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Должник");
	
	Пока ВыборкаПоДолжникам.Следующий() Цикл
		
		ВыборкаПоРезультатам = ВыборкаПоДолжникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Результат");
		
		Пока ВыборкаПоРезультатам.Следующий() Цикл
			
			НовыйКонтакт = Документы.Контакт.СоздатьДокумент();
			НовыйКонтакт.Дата = ТекущаяДатаСеанса();
			НовыйКонтакт.СделатьСтатусОсновным = Истина;
			НовыйКонтакт.Сотрудник = Справочники.Сотрудники.Автоинформатор;
			НовыйКонтакт.Должник = ВыборкаПоДолжникам.Должник;
			Если ВыборкаПоРезультатам.Результат = "отрицательно" Тогда
				НовыйКонтакт.Статус = Справочники.Статусы.НетКонтакта;
			ИначеЕсли ВыборкаПоРезультатам.Результат = "положительно" Тогда
				НовыйКонтакт.Статус = Справочники.Статусы.ОставленаИнформация;
			КонецЕсли;
			
			Выборка = ВыборкаПоРезультатам.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовыйТелефон = НовыйКонтакт.Телефоны.Добавить();
				НовыйТелефон.Телефон = Выборка.Телефон;
			КонецЦикла;
			
			НовыйКонтакт.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ: " + Строка(НовыйКонтакт));
			Попытка
				НовыйКонтакт.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл()
	ОбъектЭксель = ПолучитьCOMОбъект(ПутьКФайлу);
	ТекущаяСтрока = 1; ПозТелефон = 1; ПозРезультат = 2; Телефон = "";
	
	Телефон = СокрЛП(Строка(ОбъектЭксель.Sheets(1).Cells(ТекущаяСтрока, ПозТелефон).Value));
	Пока ЗначениеЗаполнено(Телефон) Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		Телефон = СокрЛП(Строка(ОбъектЭксель.Sheets(1).Cells(ТекущаяСтрока, ПозТелефон).Value));
		Результат = СокрЛП(Строка(ОбъектЭксель.Sheets(1).Cells(ТекущаяСтрока, ПозРезультат).Value));
			
		НоваяСтрока = Объект.тзДанныеИзФайла.Добавить();
		НоваяСтрока.Телефон = Телефон;
		НоваяСтрока.Результат = Результат;
	КонецЦикла;
КонецПроцедуры
